jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_udp.cpp
#include "../../hal_target.h"
#if HAL_TARGET_IS_RP2040
#include "../../hal_config.h"

#ifdef HAL_ENABLE_UDP

#include "../../hal_serial.h"
#include "../../hal_sync.h"
#include "../../hal_system.h"
#include "../../hal_udp.h"
#include "../shared/hal_mutex_once.h"

#if defined(HAL_NETWORK_BACKEND_CYW43)
#include "../shared/network/jh_lwip_udp.h"
#include "drivers/rp2040/rp2040_cyw43_provider.h"
#include "rp2040_network_lifecycle.h"
#else
#include <IPAddress.h>
#include <WiFiUdp.h>
#endif
#include <limits.h>
#include <stdio.h>
#include <string.h>

struct hal_udp_socket_impl_t {
#if defined(HAL_NETWORK_BACKEND_CYW43)
  jh_lwip_udp_socket_t udp;
#else
  WiFiUDP udp;
#endif
  bool in_use;
  bool bound;
  bool packet_started;
  int pending_packet_size;
  uint8_t last_remote_ip[HAL_NET_IPV4_ADDR_LEN];
  uint16_t last_remote_port;
};

static hal_udp_socket_impl_t s_udp_pool[HAL_UDP_SOCKET_MAX_INSTANCES];
static hal_udp_socket_t s_default_udp = NULL;
static hal_mutex_t s_udp_mutex = NULL;

static inline void udp_ensure_mutex(void) {
  (void)jh_hal_mutex_create_once(&s_udp_mutex);
}

#if defined(HAL_NETWORK_BACKEND_CYW43)
static void reset_socket_state(hal_udp_socket_impl_t *socket);

extern "C" hal_status_t jh_rp2040_udp_reset_all(void) {
  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);
  const hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(false);
  if (status == HAL_OK) {
    for (size_t index = 0u; index < HAL_UDP_SOCKET_MAX_INSTANCES; ++index) {
      if (s_udp_pool[index].in_use) {
        jh_lwip_udp_socket_close(&s_udp_pool[index].udp);
        reset_socket_state(&s_udp_pool[index]);
        s_udp_pool[index].in_use = false;
      }
    }
    s_default_udp = NULL;
    jh_rp2040_cyw43_provider_lwip_end();
  }
  hal_mutex_unlock(s_udp_mutex);
  return status;
}
#endif

static bool validate_out(char *out, size_t out_size, const char *fn) {
  if (!out) {
    hal_derr("%s: output buffer is NULL", fn);
    return false;
  }
  if (out_size == 0u) {
    hal_derr("%s: output buffer size is 0", fn);
    return false;
  }
  return true;
}

static bool validate_non_empty(const char *value, const char *fn,
                               const char *name) {
  if (!value || value[0] == '\0') {
    hal_derr("%s: %s is NULL/empty", fn, name);
    return false;
  }
  return true;
}

static bool validate_endpoint(const hal_net_endpoint_t *endpoint,
                              const char *fn, const char *name) {
  if (!endpoint) {
    hal_derr("%s: %s endpoint is NULL", fn, name);
    return false;
  }
  if (endpoint->family != HAL_NET_AF_INET) {
    hal_derr("%s: %s endpoint family is unsupported", fn, name);
    return false;
  }
  if (endpoint->port == 0u) {
    hal_derr("%s: %s endpoint port must be > 0", fn, name);
    return false;
  }
  return true;
}

static bool ip_is_zero(const uint8_t ip[HAL_NET_IPV4_ADDR_LEN]) {
  return ip[0] == 0u && ip[1] == 0u && ip[2] == 0u && ip[3] == 0u;
}

static void reset_last_remote(hal_udp_socket_impl_t *socket) {
  memset(socket->last_remote_ip, 0, sizeof(socket->last_remote_ip));
  socket->last_remote_port = 0u;
}

static void reset_socket_state(hal_udp_socket_impl_t *socket) {
  socket->bound = false;
  socket->packet_started = false;
  socket->pending_packet_size = 0;
  reset_last_remote(socket);
#if defined(HAL_NETWORK_BACKEND_CYW43)
  jh_lwip_udp_socket_init(&socket->udp);
#endif
}

static bool is_valid_socket_locked(hal_udp_socket_t socket) {
  for (size_t i = 0u; i < HAL_UDP_SOCKET_MAX_INSTANCES; ++i) {
    if (socket == &s_udp_pool[i] && s_udp_pool[i].in_use) {
      return true;
    }
  }
  return false;
}

static void endpoint_from_ip_address(const uint8_t ip[HAL_NET_IPV4_ADDR_LEN],
                                     uint16_t port, hal_net_endpoint_t *out) {
  if (!out) {
    return;
  }
  out->family = HAL_NET_AF_INET;
  memcpy(out->addr, ip, HAL_NET_IPV4_ADDR_LEN);
  out->port = port;
}

#if !defined(HAL_NETWORK_BACKEND_CYW43)
static IPAddress ip_address_from_endpoint(const hal_net_endpoint_t *endpoint) {
  return IPAddress(endpoint->addr[0], endpoint->addr[1], endpoint->addr[2],
                   endpoint->addr[3]);
}
#endif

static int socket_parse_packet_locked(hal_udp_socket_impl_t *socket,
                                      bool *out_has_packet) {
  if (out_has_packet != nullptr) {
    *out_has_packet = false;
  }
  if (!socket->bound) {
    return 0;
  }
  if (socket->pending_packet_size > 0) {
    if (out_has_packet != nullptr) {
      *out_has_packet = true;
    }
    return socket->pending_packet_size;
  }

  int packet_size = 0;
#if defined(HAL_NETWORK_BACKEND_CYW43)
  const hal_status_t context_status =
      jh_rp2040_cyw43_provider_lwip_begin(false);
  if (context_status != HAL_OK) {
    return -1;
  }
  packet_size = jh_lwip_udp_socket_parse(&socket->udp);
  const bool has_packet = jh_lwip_udp_socket_has_packet(&socket->udp);
  if (has_packet) {
    ip4_addr_t remote_address;
    if (jh_lwip_udp_socket_get_last_remote(&socket->udp, &remote_address,
                                           &socket->last_remote_port)) {
      socket->last_remote_ip[0] = ip4_addr1(&remote_address);
      socket->last_remote_ip[1] = ip4_addr2(&remote_address);
      socket->last_remote_ip[2] = ip4_addr3(&remote_address);
      socket->last_remote_ip[3] = ip4_addr4(&remote_address);
    }
  }
  if (out_has_packet != nullptr) {
    *out_has_packet = has_packet;
  }
  jh_rp2040_cyw43_provider_lwip_end();
#else
  packet_size = socket->udp.parsePacket();
  if (packet_size > 0) {
    socket->pending_packet_size = packet_size;
    const IPAddress remote_ip = socket->udp.remoteIP();
    for (size_t index = 0u; index < HAL_NET_IPV4_ADDR_LEN; ++index) {
      socket->last_remote_ip[index] = (uint8_t)remote_ip[index];
    }
    socket->last_remote_port = socket->udp.remotePort();
  }
  if (out_has_packet != nullptr) {
    *out_has_packet = packet_size > 0;
  }
#endif
  if (packet_size > 0) {
    socket->pending_packet_size = packet_size;
  }
  return packet_size;
}

