jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_udp.cpp
hal_status_t hal_udp_socket_open_ex(hal_udp_socket_t *out_socket) {
  if (!out_socket) {
    return HAL_EINVAL;
  }
  *out_socket = NULL;
  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  for (size_t i = 0u; i < HAL_UDP_SOCKET_MAX_INSTANCES; ++i) {
    if (!s_udp_pool[i].in_use) {
      reset_socket_state(&s_udp_pool[i]);
      s_udp_pool[i].in_use = true;
      *out_socket = &s_udp_pool[i];
      break;
    }
  }

  hal_mutex_unlock(s_udp_mutex);

  if (!*out_socket) {
    hal_derr("hal_udp_socket_open: socket pool exhausted");
    return HAL_ENOMEM;
  }
  return HAL_OK;
}

hal_udp_socket_t hal_udp_socket_open(void) {
  hal_udp_socket_t socket = NULL;
  (void)hal_udp_socket_open_ex(&socket);
  return socket;
}

hal_status_t hal_udp_socket_bind_ex(hal_udp_socket_t socket,
                                    const hal_net_endpoint_t *local) {
  if (!validate_endpoint(local, "hal_udp_socket_bind", "local")) {
    return HAL_EINVAL;
  }

  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  if (!is_valid_socket_locked(socket)) {
    hal_mutex_unlock(s_udp_mutex);
    hal_derr("hal_udp_socket_bind: socket handle is invalid");
    return HAL_EINVAL;
  }

  if (socket->bound) {
#if defined(HAL_NETWORK_BACKEND_CYW43)
    const hal_status_t context_status =
        jh_rp2040_cyw43_provider_lwip_begin(false);
    if (context_status != HAL_OK) {
      hal_mutex_unlock(s_udp_mutex);
      return context_status;
    }
    jh_lwip_udp_socket_close(&socket->udp);
    jh_rp2040_cyw43_provider_lwip_end();
#else
    socket->udp.stop();
#endif
  }
  socket->bound = false;
  socket->packet_started = false;
  socket->pending_packet_size = 0;
  reset_last_remote(socket);

#if defined(HAL_NETWORK_BACKEND_CYW43)
  hal_status_t bind_status = jh_rp2040_cyw43_provider_lwip_begin(false);
  if (bind_status == HAL_OK) {
    bind_status = jh_lwip_udp_socket_bind(&socket->udp, local->port);
    jh_rp2040_cyw43_provider_lwip_end();
  }
  const bool ok = bind_status == HAL_OK;
#else
  const bool ok = socket->udp.begin(local->port);
#endif
  if (ok) {
    socket->bound = true;
  }

  hal_mutex_unlock(s_udp_mutex);

  if (!ok) {
    hal_derr("hal_udp_socket_bind: begin(%u) failed", (unsigned)local->port);
  }
#if defined(HAL_NETWORK_BACKEND_CYW43)
  return bind_status;
#else
  return ok ? HAL_OK : HAL_EIO;
#endif
}

bool hal_udp_socket_bind(hal_udp_socket_t socket,
                         const hal_net_endpoint_t *local) {
  return hal_status_to_bool(hal_udp_socket_bind_ex(socket, local));
}

hal_status_t hal_udp_socket_sendto_ex(hal_udp_socket_t socket, const void *data,
                                      size_t len,
                                      const hal_net_endpoint_t *remote,
                                      size_t *out_sent) {
  if (out_sent) {
    *out_sent = 0u;
  }
  if (!out_sent) {
    return HAL_EINVAL;
  }
  if (len > 0u && data == NULL) {
    hal_derr("hal_udp_socket_sendto: data is NULL while len > 0");
    return HAL_EINVAL;
  }
  if (len > (size_t)INT_MAX) {
    hal_derr("hal_udp_socket_sendto: payload is too large");
    return HAL_EOVERFLOW;
  }
  if (!validate_endpoint(remote, "hal_udp_socket_sendto", "remote")) {
    return HAL_EINVAL;
  }

  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  if (!is_valid_socket_locked(socket)) {
    hal_mutex_unlock(s_udp_mutex);
    hal_derr("hal_udp_socket_sendto: socket is invalid");
    return HAL_EINVAL;
  }
  if (!socket->bound) {
    hal_mutex_unlock(s_udp_mutex);
    hal_derr("hal_udp_socket_sendto: socket is not bound");
    return HAL_ESTATE;
  }

#if defined(HAL_NETWORK_BACKEND_CYW43)
  ip4_addr_t remote_ip;
  IP4_ADDR(&remote_ip, remote->addr[0], remote->addr[1], remote->addr[2],
           remote->addr[3]);
  hal_status_t send_status = jh_rp2040_cyw43_provider_lwip_begin(true);
  if (send_status == HAL_OK) {
    send_status = jh_lwip_udp_socket_sendto(&socket->udp, data, len, &remote_ip,
                                            remote->port, out_sent);
    jh_rp2040_cyw43_provider_lwip_end();
  }
  hal_mutex_unlock(s_udp_mutex);
  return send_status;
#else
  const IPAddress remote_ip = ip_address_from_endpoint(remote);
  const bool begun = socket->udp.beginPacket(remote_ip, remote->port);
  if (!begun) {
    hal_mutex_unlock(s_udp_mutex);
    hal_derr("hal_udp_socket_sendto: beginPacket failed");
    return HAL_EIO;
  }

  size_t written = 0u;
  if (len > 0u) {
    written = socket->udp.write((const uint8_t *)data, len);
  }

  const int rc = socket->udp.endPacket();

  hal_mutex_unlock(s_udp_mutex);

  if (rc != 1) {
    hal_derr("hal_udp_socket_sendto: endPacket failed (rc=%d)", rc);
    return HAL_EIO;
  }

  *out_sent = written;
  return HAL_OK;
#endif
}

int hal_udp_socket_sendto(hal_udp_socket_t socket, const void *data, size_t len,
                          const hal_net_endpoint_t *remote) {
  size_t sent = 0u;
  return hal_status_is_ok(
             hal_udp_socket_sendto_ex(socket, data, len, remote, &sent))
             ? (int)sent
             : -1;
}

hal_status_t hal_udp_socket_recvfrom_ex(hal_udp_socket_t socket, void *buffer,
                                        size_t max_len,
                                        hal_net_endpoint_t *remote,
                                        uint32_t timeout_ms,
                                        size_t *out_received) {
  if (out_received) {
    *out_received = 0u;
  }
  if (!out_received) {
    return HAL_EINVAL;
  }
  if (max_len > 0u && buffer == NULL) {
    hal_derr("hal_udp_socket_recvfrom: buffer is NULL while max_len > 0");
    return HAL_EINVAL;
  }
  if (max_len > (size_t)INT_MAX) {
    return HAL_EOVERFLOW;
  }

  const uint32_t start_ms = hal_millis();

  for (;;) {
    udp_ensure_mutex();
    hal_mutex_lock(s_udp_mutex);

    if (!is_valid_socket_locked(socket)) {
      hal_mutex_unlock(s_udp_mutex);
      hal_derr("hal_udp_socket_recvfrom: socket is invalid");
      return HAL_EINVAL;
    }
    if (!socket->bound) {
      hal_mutex_unlock(s_udp_mutex);
      hal_derr("hal_udp_socket_recvfrom: socket is not bound");
      return HAL_ESTATE;
    }

    bool has_packet = false;
    const int packet_size = socket_parse_packet_locked(socket, &has_packet);
    if (packet_size < 0) {
      hal_mutex_unlock(s_udp_mutex);
      return HAL_EIO;
    }
    if (has_packet) {
      endpoint_from_ip_address(socket->last_remote_ip, socket->last_remote_port,
                               remote);
#if defined(HAL_NETWORK_BACKEND_CYW43)
      size_t received = 0u;
      hal_status_t read_status = HAL_OK;
      if (max_len > 0u) {
        read_status = jh_rp2040_cyw43_provider_lwip_begin(false);
        if (read_status == HAL_OK) {
          read_status = jh_lwip_udp_socket_read(&socket->udp, buffer, max_len,
                                                true, &received);
          jh_rp2040_cyw43_provider_lwip_end();
        }
        socket->pending_packet_size = 0;
      }

      hal_mutex_unlock(s_udp_mutex);
      if (read_status != HAL_OK) {
        return read_status;
      }
      *out_received = received;
      return HAL_OK;
#else
      int read_count = 0;
      if (max_len > 0u) {
        read_count = socket->udp.read((uint8_t *)buffer, max_len);
        socket->pending_packet_size = 0;
      }

      hal_mutex_unlock(s_udp_mutex);
      if (read_count < 0) {
        return HAL_EIO;
      }
      *out_received = (size_t)read_count;
      return HAL_OK;
#endif
    }

    hal_mutex_unlock(s_udp_mutex);

