jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_udp.cpp
    if (timeout_ms == 0u) {
      return HAL_OK;
    }
    if (timeout_ms != HAL_NET_TIMEOUT_FOREVER &&
        (uint32_t)(hal_millis() - start_ms) >= timeout_ms) {
      return HAL_OK;
    }

    hal_idle();
    hal_delay_ms(1u);
  }
}

int hal_udp_socket_recvfrom(hal_udp_socket_t socket, void *buffer,
                            size_t max_len, hal_net_endpoint_t *remote,
                            uint32_t timeout_ms) {
  size_t received = 0u;
  return hal_status_is_ok(hal_udp_socket_recvfrom_ex(
             socket, buffer, max_len, remote, timeout_ms, &received))
             ? (int)received
             : -1;
}

bool hal_udp_socket_can_recv(hal_udp_socket_t socket) {
  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  bool has_packet = false;
  if (is_valid_socket_locked(socket) && socket->bound) {
    (void)socket_parse_packet_locked(socket, &has_packet);
  }
  const bool ready = has_packet;

  hal_mutex_unlock(s_udp_mutex);
  return ready;
}

bool hal_udp_socket_can_send(hal_udp_socket_t socket) {
  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  const bool ready = is_valid_socket_locked(socket) && socket->bound;

  hal_mutex_unlock(s_udp_mutex);
  return ready;
}

void hal_udp_socket_close(hal_udp_socket_t socket) {
  if (!socket) {
    return;
  }

  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  if (!is_valid_socket_locked(socket)) {
    hal_mutex_unlock(s_udp_mutex);
    return;
  }

#if defined(HAL_NETWORK_BACKEND_CYW43)
  const hal_status_t context_status =
      jh_rp2040_cyw43_provider_lwip_begin(false);
  if (context_status == HAL_OK) {
    jh_lwip_udp_socket_close(&socket->udp);
    jh_rp2040_cyw43_provider_lwip_end();
  }
#else
  socket->udp.stop();
#endif
  socket->in_use = false;
  reset_socket_state(socket);
  if (s_default_udp == socket) {
    s_default_udp = NULL;
  }

  hal_mutex_unlock(s_udp_mutex);
}

hal_status_t hal_udp_begin_ex(uint16_t local_port) {
  if (local_port == 0u) {
    hal_derr("hal_udp_begin: local_port must be > 0");
    return HAL_EINVAL;
  }

  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);
  const bool default_valid = is_valid_socket_locked(s_default_udp);
  hal_mutex_unlock(s_udp_mutex);

  if (!default_valid) {
    const hal_status_t open_status = hal_udp_socket_open_ex(&s_default_udp);
    if (hal_status_is_error(open_status)) {
      hal_derr("hal_udp_begin: socket allocation failed");
      return open_status;
    }
  }

  hal_net_endpoint_t local = {};
  local.family = HAL_NET_AF_INET;
  local.port = local_port;

  const hal_status_t status = hal_udp_socket_bind_ex(s_default_udp, &local);
  if (hal_status_is_error(status)) {
    hal_derr("hal_udp_begin: bind(%u) failed", (unsigned)local_port);
  }
  return status;
}

bool hal_udp_begin(uint16_t local_port) {
  return hal_status_to_bool(hal_udp_begin_ex(local_port));
}

void hal_udp_stop(void) { hal_udp_socket_close(s_default_udp); }

hal_status_t hal_udp_parse_packet_ex(int *out_size) {
  if (!out_size) {
    return HAL_EINVAL;
  }
  *out_size = 0;
  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  if (!is_valid_socket_locked(s_default_udp) || !s_default_udp->bound) {
    hal_mutex_unlock(s_udp_mutex);
    return HAL_EUNINIT;
  }

  const int packet_size = socket_parse_packet_locked(s_default_udp, NULL);

  hal_mutex_unlock(s_udp_mutex);
  if (packet_size < 0) {
    return HAL_EIO;
  }
  *out_size = packet_size;
  return HAL_OK;
}

int hal_udp_parse_packet(void) {
  int size = 0;
  (void)hal_udp_parse_packet_ex(&size);
  return size;
}

hal_status_t hal_udp_read_ex(uint8_t *buffer, uint16_t max_len,
                             uint16_t *out_read) {
  if (out_read) {
    *out_read = 0u;
  }
  if (!out_read) {
    return HAL_EINVAL;
  }
  if (max_len > 0u && buffer == NULL) {
    hal_derr("hal_udp_read: buffer is NULL while max_len > 0");
    return HAL_EINVAL;
  }
  if (max_len == 0u) {
    return HAL_OK;
  }

  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  if (!is_valid_socket_locked(s_default_udp) || !s_default_udp->bound) {
    hal_mutex_unlock(s_udp_mutex);
    return HAL_EUNINIT;
  }

#if defined(HAL_NETWORK_BACKEND_CYW43)
  size_t read_count = 0u;
  hal_status_t read_status = jh_rp2040_cyw43_provider_lwip_begin(false);
  if (read_status == HAL_OK) {
    read_status = jh_lwip_udp_socket_read(&s_default_udp->udp, buffer, max_len,
                                          false, &read_count);
    s_default_udp->pending_packet_size =
        jh_lwip_udp_socket_parse(&s_default_udp->udp);
    jh_rp2040_cyw43_provider_lwip_end();
  }
#else
  const int read_count = s_default_udp->udp.read(buffer, max_len);
  s_default_udp->pending_packet_size = 0;
#endif

  hal_mutex_unlock(s_udp_mutex);
#if defined(HAL_NETWORK_BACKEND_CYW43)
  if (read_status != HAL_OK) {
    return read_status;
  }
#else
  if (read_count < 0) {
    return HAL_EIO;
  }
#endif
  *out_read = (uint16_t)read_count;
  return HAL_OK;
}

int hal_udp_read(uint8_t *buffer, uint16_t max_len) {
  uint16_t read = 0u;
  const hal_status_t status = hal_udp_read_ex(buffer, max_len, &read);
  return hal_status_is_ok(status) || status == HAL_EUNINIT ? (int)read : -1;
}

hal_status_t hal_udp_remote_ip_ex(char *out, size_t out_size) {
  if (!validate_out(out, out_size, "hal_udp_remote_ip")) {
    return HAL_EINVAL;
  }

  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  uint8_t remote_ip[HAL_NET_IPV4_ADDR_LEN] = {};
  uint16_t remote_port = 0u;
  const bool default_ready =
      is_valid_socket_locked(s_default_udp) && s_default_udp->bound;
  if (default_ready) {
    memcpy(remote_ip, s_default_udp->last_remote_ip, sizeof(remote_ip));
    remote_port = s_default_udp->last_remote_port;
  }

  hal_mutex_unlock(s_udp_mutex);

  if (remote_port == 0u || ip_is_zero(remote_ip)) {
    const int written = snprintf(out, out_size, "%s", "0.0.0.0");
    if (written < 0) {
      hal_derr("hal_udp_remote_ip: snprintf failed for empty endpoint");
      return HAL_EIO;
    }
    if ((size_t)written >= out_size) {
      return HAL_EOVERFLOW;
    }
    return default_ready ? HAL_ENOENT : HAL_EUNINIT;
  }

