jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_udp.cpp
  const int written = snprintf(out, out_size, "%u.%u.%u.%u",
                               (unsigned)remote_ip[0], (unsigned)remote_ip[1],
                               (unsigned)remote_ip[2], (unsigned)remote_ip[3]);
  if (written < 0) {
    hal_derr("hal_udp_remote_ip: snprintf failed");
    return HAL_EIO;
  }
  return (size_t)written < out_size ? HAL_OK : HAL_EOVERFLOW;
}

bool hal_udp_remote_ip(char *out, size_t out_size) {
  return hal_status_to_bool(hal_udp_remote_ip_ex(out, out_size));
}

hal_status_t hal_udp_remote_port_ex(uint16_t *out_port) {
  if (!out_port) {
    return HAL_EINVAL;
  }
  *out_port = 0u;
  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  const bool default_ready =
      is_valid_socket_locked(s_default_udp) && s_default_udp->bound;
  const uint16_t remote_port =
      default_ready ? s_default_udp->last_remote_port : 0u;

  hal_mutex_unlock(s_udp_mutex);
  *out_port = remote_port;
  if (!default_ready) {
    return HAL_EUNINIT;
  }
  return remote_port != 0u ? HAL_OK : HAL_ENOENT;
}

uint16_t hal_udp_remote_port(void) {
  uint16_t port = 0u;
  (void)hal_udp_remote_port_ex(&port);
  return port;
}

hal_status_t hal_udp_begin_packet_ex(const char *host_or_ip,
                                     uint16_t remote_port) {
  if (!validate_non_empty(host_or_ip, "hal_udp_begin_packet", "host_or_ip")) {
    return HAL_EINVAL;
  }
  if (remote_port == 0u) {
    hal_derr("hal_udp_begin_packet: remote_port must be > 0");
    return HAL_EINVAL;
  }

  udp_ensure_mutex();
#if defined(HAL_NETWORK_BACKEND_CYW43)
  hal_mutex_lock(s_udp_mutex);
  const bool default_ready =
      is_valid_socket_locked(s_default_udp) && s_default_udp->bound;
  hal_mutex_unlock(s_udp_mutex);
  if (!default_ready) {
    hal_derr("hal_udp_begin_packet: UDP socket is not started");
    return HAL_EUNINIT;
  }

  uint8_t resolved_address[HAL_NET_IPV4_ADDR_LEN] = {};
  const hal_status_t resolve_status =
      hal_net_resolve_ipv4_ex(host_or_ip, resolved_address);
  if (resolve_status != HAL_OK) {
    return resolve_status;
  }
#endif
  hal_mutex_lock(s_udp_mutex);

  if (!is_valid_socket_locked(s_default_udp) || !s_default_udp->bound) {
    hal_mutex_unlock(s_udp_mutex);
    hal_derr("hal_udp_begin_packet: UDP socket is not started");
    return HAL_EUNINIT;
  }

#if defined(HAL_NETWORK_BACKEND_CYW43)
  ip4_addr_t remote_address;
  IP4_ADDR(&remote_address, resolved_address[0], resolved_address[1],
           resolved_address[2], resolved_address[3]);
  hal_status_t begin_status = jh_rp2040_cyw43_provider_lwip_begin(true);
  if (begin_status == HAL_OK) {
    begin_status = jh_lwip_udp_socket_begin_packet(
        &s_default_udp->udp, &remote_address, remote_port);
    jh_rp2040_cyw43_provider_lwip_end();
  }
  const bool ok = begin_status == HAL_OK;
#else
  const bool ok = s_default_udp->udp.beginPacket(host_or_ip, remote_port);
#endif
  s_default_udp->packet_started = ok;

  hal_mutex_unlock(s_udp_mutex);

  if (!ok) {
    hal_derr("hal_udp_begin_packet: beginPacket failed");
  }
#if defined(HAL_NETWORK_BACKEND_CYW43)
  return begin_status;
#else
  return ok ? HAL_OK : HAL_EIO;
#endif
}

bool hal_udp_begin_packet(const char *host_or_ip, uint16_t remote_port) {
  return hal_status_to_bool(hal_udp_begin_packet_ex(host_or_ip, remote_port));
}

hal_status_t hal_udp_begin_packet_remote_ex(void) {
  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  if (!is_valid_socket_locked(s_default_udp) || !s_default_udp->bound) {
    hal_mutex_unlock(s_udp_mutex);
    hal_derr("hal_udp_begin_packet_remote: UDP socket is not started");
    return HAL_EUNINIT;
  }

  if (s_default_udp->last_remote_port == 0u ||
      ip_is_zero(s_default_udp->last_remote_ip)) {
    hal_mutex_unlock(s_udp_mutex);
    hal_derr("hal_udp_begin_packet_remote: remote endpoint is not available");
    return HAL_ENOENT;
  }

#if defined(HAL_NETWORK_BACKEND_CYW43)
  ip4_addr_t remote_address;
  IP4_ADDR(&remote_address, s_default_udp->last_remote_ip[0],
           s_default_udp->last_remote_ip[1], s_default_udp->last_remote_ip[2],
           s_default_udp->last_remote_ip[3]);
  hal_status_t begin_status = jh_rp2040_cyw43_provider_lwip_begin(true);
  if (begin_status == HAL_OK) {
    begin_status = jh_lwip_udp_socket_begin_packet(
        &s_default_udp->udp, &remote_address, s_default_udp->last_remote_port);
    jh_rp2040_cyw43_provider_lwip_end();
  }
  const bool ok = begin_status == HAL_OK;
#else
  const IPAddress remote_address(
      s_default_udp->last_remote_ip[0], s_default_udp->last_remote_ip[1],
      s_default_udp->last_remote_ip[2], s_default_udp->last_remote_ip[3]);
  const bool ok = s_default_udp->udp.beginPacket(
      remote_address, s_default_udp->last_remote_port);
#endif
  s_default_udp->packet_started = ok;

  hal_mutex_unlock(s_udp_mutex);

  if (!ok) {
    hal_derr("hal_udp_begin_packet_remote: beginPacket failed");
  }
#if defined(HAL_NETWORK_BACKEND_CYW43)
  return begin_status;
#else
  return ok ? HAL_OK : HAL_EIO;
#endif
}

bool hal_udp_begin_packet_remote(void) {
  return hal_status_to_bool(hal_udp_begin_packet_remote_ex());
}

hal_status_t hal_udp_write_ex(const uint8_t *data, uint16_t len,
                              uint16_t *out_written) {
  if (out_written) {
    *out_written = 0u;
  }
  if (!out_written) {
    return HAL_EINVAL;
  }
  if (len > 0u && data == NULL) {
    hal_derr("hal_udp_write: data is NULL while len > 0");
    return HAL_EINVAL;
  }
  if (len == 0u) {
    return HAL_OK;
  }

  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  if (!is_valid_socket_locked(s_default_udp) || !s_default_udp->bound) {
    hal_mutex_unlock(s_udp_mutex);
    return HAL_EUNINIT;
  }
  if (!s_default_udp->packet_started) {
    hal_mutex_unlock(s_udp_mutex);
    return HAL_ESTATE;
  }

#if defined(HAL_NETWORK_BACKEND_CYW43)
  size_t written = 0u;
  hal_status_t write_status = jh_rp2040_cyw43_provider_lwip_begin(false);
  if (write_status == HAL_OK) {
    write_status =
        jh_lwip_udp_socket_write(&s_default_udp->udp, data, len, &written);
    jh_rp2040_cyw43_provider_lwip_end();
  }
#else
  size_t written = s_default_udp->udp.write(data, len);
#endif
  if (written > 65535u) {
    written = 65535u;
  }

  hal_mutex_unlock(s_udp_mutex);

