jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_udp.cpp
  *out_written = (uint16_t)written;
#if defined(HAL_NETWORK_BACKEND_CYW43)
  return write_status;
#else
  return written == len ? HAL_OK : HAL_EIO;
#endif
}

uint16_t hal_udp_write(const uint8_t *data, uint16_t len) {
  uint16_t written = 0u;
  (void)hal_udp_write_ex(data, len, &written);
  return written;
}

hal_status_t hal_udp_write_str_ex(const char *text, uint16_t *out_written) {
  if (!text) {
    hal_derr("hal_udp_write_str: text is NULL");
    return HAL_EINVAL;
  }
  if (!out_written) {
    return HAL_EINVAL;
  }
  const size_t len = strlen(text);
  if (len > UINT16_MAX) {
    *out_written = 0u;
    return HAL_EOVERFLOW;
  }
  return hal_udp_write_ex((const uint8_t *)text, (uint16_t)len, out_written);
}

uint16_t hal_udp_write_str(const char *text) {
  uint16_t written = 0u;
  (void)hal_udp_write_str_ex(text, &written);
  return written;
}

hal_status_t hal_udp_end_packet_ex(void) {
  udp_ensure_mutex();
  hal_mutex_lock(s_udp_mutex);

  if (!is_valid_socket_locked(s_default_udp) || !s_default_udp->bound ||
      !s_default_udp->packet_started) {
    hal_mutex_unlock(s_udp_mutex);
    return HAL_ESTATE;
  }

#if defined(HAL_NETWORK_BACKEND_CYW43)
  hal_status_t end_status = jh_rp2040_cyw43_provider_lwip_begin(true);
  if (end_status == HAL_OK) {
    end_status = jh_lwip_udp_socket_end_packet(&s_default_udp->udp);
    jh_rp2040_cyw43_provider_lwip_end();
  }
#else
  const int rc = s_default_udp->udp.endPacket();
#endif
  s_default_udp->packet_started = false;

  hal_mutex_unlock(s_udp_mutex);

#if defined(HAL_NETWORK_BACKEND_CYW43)
  return end_status;
#else
  if (rc != 1) {
    hal_derr("hal_udp_end_packet: endPacket failed (rc=%d)", rc);
    return HAL_EIO;
  }

  return HAL_OK;
#endif
}

bool hal_udp_end_packet(void) {
  return hal_status_to_bool(hal_udp_end_packet_ex());
}

#endif /* HAL_ENABLE_UDP */
#endif // HAL_TARGET_IS_RP2040
